<a href="https://colab.research.google.com/github/SimphiweSixeki/ADS-Assignment-2-3/blob/main/Assignment_2_and_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Uncover the factors that lead to employee attrition and explore important questions such as:

1. Show a breakdown of distance from home by job role and attrition.

2. Compare average monthly income by education and attrition.

In [1]:
from google.colab import drive
drive.mount('/content/gdrive', force_remount = True)

import sys
sys.path.append('/content/gdrive/My Drive/DataScienceSchool/Assignments/ADS-Assignment-2-3')

Mounted at /content/gdrive

In [13]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib

Using matplotlib backend: agg

In [5]:
df = pd.read_csv('/content/gdrive/My Drive/DataScienceSchool/Assignments/ADS-Assignment-2-3/WA_Fn-UseC_-HR-Employee-Attrition.csv')
df

      Age Attrition  ... YearsSinceLastPromotion  YearsWithCurrManager
0      41       Yes  ...                       0                     5
1      49        No  ...                       1                     7
2      37       Yes  ...                       0                     0
3      33        No  ...                       3                     0
4      27        No  ...                       2                     2
...   ...       ...  ...                     ...                   ...
1465   36        No  ...                       0                     3
1466   39        No  ...                       1                     7
1467   27        No  ...                       0                     3
1468   49        No  ...                       0                     8
1469   34        No  ...                       1                     2

[1470 rows x 35 columns]

In [6]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [7]:
df.dtypes

Age                          int64
Attrition                   object
BusinessTravel              object
DailyRate                    int64
Department                  object
DistanceFromHome             int64
Education                    int64
EducationField              object
EmployeeCount                int64
EmployeeNumber               int64
EnvironmentSatisfaction      int64
Gender                      object
HourlyRate                   int64
JobInvolvement               int64
JobLevel                     int64
JobRole                     object
JobSatisfaction              int64
MaritalStatus               object
MonthlyIncome                int64
MonthlyRate                  int64
NumCompaniesWorked           int64
Over18                      object
OverTime                    object
PercentSalaryHike            int64
PerformanceRating            int64
RelationshipSatisfaction     int64
StandardHours                int64
StockOptionLevel             int64
TotalWorkingYears            int64
TrainingTimesLastYear        int64
WorkLifeBalance              int64
YearsAtCompany               int64
YearsInCurrentRole           int64
YearsSinceLastPromotion      int64
YearsWithCurrManager         int64
dtype: object

In [9]:
df.DistanceFromHome.nunique()

29

1. Show a breakdown of distance from home by job role and attrition.

In [10]:
df.groupby(['JobRole', 'Attrition'])['DistanceFromHome'].mean().unstack().head(30)

Attrition                        No        Yes
JobRole
Healthcare Representative  9.204918  17.666667
Human Resources            6.600000  13.416667
Laboratory Technician      9.329949   9.661290
Manager                    7.927835  10.000000
Manufacturing Director     9.533333   8.800000
Research Director          8.474359   7.000000
Research Scientist         8.869388   9.765957
Sales Executive            9.026022  12.649123
Sales Representative       9.000000   8.151515

We can also visualize the above data

In [17]:
plt.figure(figsize = (22, 12))
sns.barplot(x = 'JobRole', y = 'DistanceFromHome', data = df, hue = 'Attrition')

2. Compare average monthly income by education and attrition.

In [19]:
df['Education'].nunique()

5

In [20]:
df['MonthlyIncome'].nunique()

1349

In [22]:
df.groupby(['Education', 'Attrition'])['MonthlyIncome'].mean().unstack()

Attrition           No          Yes
Education
1          5926.129496  4360.161290
2          6586.058824  4282.545455
3          6882.919662  4770.242424
4          7087.814706  5335.155172
5          8559.906977  5850.200000

In [23]:
plt.figure(figsize=(22, 12))
sns.barplot(x='Education', y = 'MonthlyIncome', data = df, hue = 'Attrition')